package hw;

import java.util.Scanner;

/*
 * Topic: 輸入一段文字 ( 限制為 ASCII 表中，編號 32 至 125 之字元 ) ，將它們每個字元 依照鍵盤的位置，印出它們右邊的字元，若右邊按鍵有兩層字元 ( 如 : 和 ; 位於同 一按鍵上 ) ，則輸出下層字元，即 ”;” ，若該按鍵為上層字元 ( 如 !) 則輸出其右 邊按鍵之上層字元 ( 如 @) ，若輸入的字元右邊的鍵為不可視按鍵，如 shift, enter,backspace 或右邊已無按鍵，如不做更動，照樣輸出。
 * Date: 2016/12/26
 * Author: 103051089 林冠磊
 */
public class hw02_103051089 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		String[][] ascii= {	{" "," "},		{"!","@"},	{"\"","\""},	{"#","$"},	{"$","%"},	{"%","&"},	{"'","'"},		{"(",")"},		{")","_"},		{"*","("},
										{"+","+"},	{",","."},		{"-","="},	{".","/"},		{"/","/"},		{"0","-"},		{"1","2"},	{"2","3"},	{"3","4"},	{"4","5"},	
										{"5","6"},	{"6","7"},	{"7","8"},	{"8","9"},	{"9","0"},	{":","\"" },	{";","'"},		{"<",">"},	{"=","="},	{">","?"},
										{"?","?"},		{"@","#"},	{"A","s"},	{"B","n"},	{"C","v"},	{"D","f"},		{"E","e"},	{"F","g"},	{"G","H"},	{"H","h"},	
										{"I","o"},		{"J","k"},		{"K","l"},		{"L",";"},		{"M",","},	{"N","m"},	{"O","p"},	{"P","["},		{"Q","w"},	{"R","t"},	
										{"S","d"},	{"T","t"},		{"U","i"},		{"V","b"},	{"W","e"},	{"X","c"},	{"Y","z"},	{"Z","x"},	{"[","]"},		{"\\" , "\\"},	
										{"]","\\"},		{"^" , "&"},{"_" , "+"},	{"`" , "1"},	{"a" , "b"},	{"b" , "n"},	{"c" , "v"},	{"d" , "f"},	{"e" , "r"},	{"f" , "g"},	
										{"g" , "h"},	{"h" , "j"},	{"i" , "o"},	{"j" , "k"},	{"k" , "l"},	{"l" , ";"},		{"m" , ","},	{"n" , "m"},	{"o" , "p"},	{"p" , "["},	
										{"q" , "w"},	{"r" , "t"},	{"s" , "d"},	{"t" , "y"},	{"u" , "i"},	{"v" , "b"},	{"w" , "e"},	{"x" , "c"},	{"y" , "u"},	{"z" , "x"},	
										{"{" , "}"},	{"|" , "|"},		{"}" , "|"},		{"~" , "!"}};
		Scanner sc = new Scanner(System.in);
		String input = sc.nextLine();
		char [] data = input.toCharArray();
		for(int i = 0; i < data.length; i++){
			System.out.print(ascii[(int)data[i]-33][1]);

		}
		System.out.println();		
	}
}
